Tekla Open API Reference for Tekla Structures 2025
ModelHandler.CreateNewMultiUserModel Method
 Creates a new multi-user model.
 Current model is not saved in the operation.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool CreateNewMultiUserModel(
	string ModelName,
	string ModelFolder,
	string ServerName
)
Public Function CreateNewMultiUserModel (
	ModelName As String,
	ModelFolder As String,
	ServerName As String
) As Boolean
Parameters
ModelName
Type: System.String
The name for the new model.
ModelFolder
Type: System.String
The folder path for the new model.
ServerName
Type: System.String
The multi user server name.
Return Value
Type: Boolean
True on success.
See Also
Reference
ModelHandler Class
Tekla.Structures.Model Namespace